
#include <include.h>
#include <..\USB\USB_Include.h>


/*--------------------------------------------------------------------------------------
 Func: USB标准设备描述
 Time: 2011-4-27
 Note: 
------------------------------------------------------------------------------------- */
const uint8 USB_DeviceDesc[] =
  {
    0x12,                       				//device_desc表长度
    USB_DEVICE_DESCRIPTOR_TYPE, 				//设备描述表类
    0x00,                       				//bcdUSB-version	USB2.0
    0x02,
    0x00,                       				//设备类
    0x00,                       				//设备子类
    0x00,                       				//设备协议
    USB_ENDP0_PACKETSIZE,          				//最大包长度	8/16/32/64
    0x83,                       				//厂商ID (0x0483)
    0x04,
    0x50,                       				//产品ID = 0x5750
    0x57,
    0x00,                       				//设备版本
    0x02,
    1,                          				//厂商字符描述表位置索引
    2,                          				//产品字符描述表位置索引
    3,                          				//设备串号字符描述表索引
    0x01                        				//配置描述表项数
  };											


/*--------------------------------------------------------------------------------------
 Func: USB标准设备配置表
 Time: 2011-4-27
 Note: 
------------------------------------------------------------------------------------- */
const uint8 USB_ConfigDesc[] =
  {
    /*-------------------------配置描述----------------------------*/
	0x09, 										//配置表长度
    USB_CONFIGURATION_DESCRIPTOR_TYPE, 			//配置表类型
    0x20,										//配置描述表总长度											  	    
    0x00,
    0x01,         								//设备支持的接口数
    0x01,         								//本配置选中值Set_Configuration()
    0x00,         								//本配置字符描述索引
    0xC0,         								//总线电源属性 D6/自供电 D5/行程唤醒 D7->1
    0x32,         								//最大电流 N*2 mA
    /*-------------------------接口描述----------------------------*/
    0x09,         								//接口描述表长度
    USB_INTERFACE_DESCRIPTOR_TYPE,				//接口描述表类型
    0x00,         								//接口编号
    0x00,         								//接口编码 SetInterface()
    0x02,         								//接口包含的端点数 0/control pipe
    0x08,        								//接口类型 		HID: 0x03	MASS:0x08
    0x06,         								//接口子类型 	HID: 1=BOOT, 0=no boot
    0x50,         								//接口协议类型 	HID: 0=none, 1=keyboard, 2=mouse */
    4,											//接口字符串描述索引
	/*-------------------------端点描述----------------------------*/
    0x07,   									//端点描述表长度
    USB_ENDPOINT_DESCRIPTOR_TYPE,				//端点描述表类型  										//
    0x81,   									//端点方向及端点号(IN)  B7|B[3:0]
    USB_ENDPOINT_TYPE_BULK,						//端点类型[BULK]
    USB_ENDP1_PACKETSIZE,   									
    0x00,										//端点最大缓冲区大小
    0x00,   									//端点中断间隔
    
    0x07,   									//端点描述表长度
    USB_ENDPOINT_DESCRIPTOR_TYPE,				//端点描述表类型  	
    0x02,   									//端点方向及端点号(OUT)  B7|B[3:0]
    USB_ENDPOINT_TYPE_BULK,						//端点类型[BULK]
    USB_ENDP2_PACKETSIZE,										
    0x00,										//端点最大缓冲区大小
    0x00     									//端点中断间隔
};


/*----------------------------------------------------------------------------------------
 Func: 字符串描述表		/ * LangID = 0x0409: U.S. English * /
----------------------------------------------------------------------------------------*/
const uint8 USB_StringLangID[] =
{
    4,
    USB_STRING_DESCRIPTOR_TYPE,							  
    0x09,
    0x04												   
}; 

/*----------------------------------------------------------------------------------------
 Func: 厂商字符串描述串
----------------------------------------------------------------------------------------*/
const uint8 USB_StringVendor[] =
{	    
	34, 										/* Size of Vendor string */
    USB_STRING_DESCRIPTOR_TYPE,  				/* bDescriptorType*/
    /*HUBEI-QYKJ@2011*/
    'H', 0, 'U', 0, '-', 0, 'B', 0, 'E', 0, 'I', 0, '-', 0, 'Q', 0,
    'Y', 0, 'K', 0, 'J', 0, '@', 0, '2', 0, '0', 0, '1', 0, '1', 0
};

/*----------------------------------------------------------------------------------------
 Func: 产品字符串描述串
----------------------------------------------------------------------------------------*/
const uint8 USB_StringProduct[] =
{
	34,          						/* bLength */
    USB_STRING_DESCRIPTOR_TYPE,         /* bDescriptorType */
	/*HUBEI-QYKJ-TTS-USB*/
    'H', 0, 'B', 0, '-', 0, 'Q', 0,	'Y', 0, 'K', 0, 'J', 0, '-', 0, 
	'T', 0, 'T', 0, 'S', 0, '-', 0, 'U', 0, 'S', 0, 'B', 0, ' ', 0
};

/*----------------------------------------------------------------------------------------
 Func: 串号字符串
----------------------------------------------------------------------------------------*/
const uint8 USB_StringSerial[] =
{
    15,									//字符串长度
	USB_STRING_DESCRIPTOR_TYPE,        	//串类型		   //0200310
    '0', 0, '2', 0, '0', 0,'0', 0,'3', 0, '1', 0, '0', 0
};

/*----------------------------------------------------------------------------------------
 Func: 接口字符串描述串
----------------------------------------------------------------------------------------*/
const uint8 USB_StringInterface[] =
{	    
	18, 										/* Size of Vendor string */
    USB_STRING_DESCRIPTOR_TYPE,  				/* bDescriptorType*/
    /*QYKJMASS*/
    'Q', 0, 'Y', 0, 'K', 0, 'J', 0, 'M', 0, 'A', 0, 'S', 0, 'S', 0,
};

