
#ifndef _TTS_RTC_DRIVER_H_
#define _TTS_RTC_DRIVER_H_

#include <Include.h>
#include <Tos_Include.h>


typedef struct 
{
	 u8 hour;
	 u8 min;
	 u8 sec;                  
	 u16 w_year;
	 u8  w_month;
	 u8  w_date;
	 u8  week;             
}DateTime;

extern DateTime Timer;

/*------------------------------------------------------------
 Func: 本方法时间起点从2000-1-1 0:0:0开始,向后编码150年
------------------------------------------------------------*/
uint32 RTC_EncodeTime(Date_Time * DT);

/*------------------------------------------------------------
 Func: 本方法时间起点从2000-1-1 0:0:0开始,向后解码150年
------------------------------------------------------------*/
 void RTC_DecodeTime(uint32 TimeData,Date_Time * DT);

/*------------------------------------------------------------
 Func: 获取系统时间
------------------------------------------------------------*/
void RTC_GetDateTime(void);

/*------------------------------------------------------------
 Func: 设置系统时间
------------------------------------------------------------*/
void RTC_SetDateTime(void);

/*------------------------------------------------------------				  
 Func: 系统定时取时间
------------------------------------------------------------*/
//void RTC_Init(void);


void DeviceMount_RTC(void);

#endif
